package com.song.cn.oj.tztt;

/**
 * 题目一：
 *
 * 1、现有一批位置数据，见data.txt（附件Java_exam1目录下）；
 *
 * 2、为了确定位置的大致范围，需要选取一部分经纬度进行连线，绘制成一个闭合图形，使得图形的边数最少，且能将所有经纬度坐圈在图形内（含边上）；
 *
 * 3、请计算输出对应的多边形顶点坐标集合，以"118.35415,32.5556"字符串形式的List返回（对List顺序无要求）；
 *
 * 4、说明：点位置分布如location.png所示，可利用代码ChartUtil.java绘制边界图形方便验证（可用可不用）。
 *
 * 5、按文件Test.java类中test方法出入参数要求实现代码，要求代码思路注释清晰。
 *
 *
 *
 * 要求：附件中提供的jar包非必须，不添加额外jar包，独立编程实现代码逻辑
 *
 * 考核知识点：bcp数据解析,经纬度、排序、查找、计算
 */
public class Exam1 {

    public static void main(String[] args) {

    }
}
